<template>
  <div>
    <div class="pay-information-setting">
      <ul>
        <li>
          <span class="pay-info-title">服务商商户号：</span>
          <span class="pay-info-txt">{{merchantNumber}}</span>
          <el-button type="primary" size="small" @click="setMerchantNumber">设置</el-button>
          <span>获取方法：微信支付商户后台 > 账户中心 > 账户设置 > 商户信息 > 微信支付商户号</span>
        </li>
        <li>
          <span class="pay-info-title">服务商商户秘钥：</span>
          <span class="pay-info-txt">{{businessSecretKey}}</span>
          <el-button type="primary" size="small" @click="setMerchantNumber">设置</el-button>
          <span>获取方法：微信支付商户后台 > 账户中心 > 账户设置 > API 安全 > API 秘钥</span>
        </li>
        <li>
          <span class="pay-info-title">服务商P12证书：</span>
          <span class="pay-info-txt">{{p12Certificate}}</span>
          <el-button type="primary" size="small" @click="setMerchantNumber">上传</el-button>
          <span>获取方法：微信支付商户后台 > 账户中心 > 账户设置 > API安全 > 下载证书。<br>得到的 apiclient_cert.p12 文件后，点击右侧的上传按钮进行上传即可。</span>
        </li>
        <li>
          <span class="pay-info-title">升级支付接口：</span>
          <span class="pay-info-txt"></span>
          <el-button type="primary" size="small" @click="setMerchantNumber">免费升级</el-button>
          <span>如果您是特约支付商户，创建社交立减金前需要完成接口升级</span>
        </li>
      </ul>
      <div class="checked-protocol" v-if="agreementShow">
        <el-checkbox v-model="checked">
          <span class="checked-protocol-text">我已同意并阅读</span>
          <el-button type="text" @click="readingProtocol = true">《协议》</el-button>
        </el-checkbox>
        <el-dialog
          title="提示"
          :visible.sync="readingProtocol"
          width="60%">
          <span>这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级这是一段信息创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级创建社交立减金前需要完成接口升级级要完成接口升级级</span>
          <span slot="footer" class="dialog-footer">
            <el-button type="primary" size="small" @click="readingProtocol = false">确 定</el-button>
          </span>
        </el-dialog>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data () {
    return {
      merchantNumber: '--',
      businessSecretKey: 'UedEVaPixDUY04g8MfGNUVBOx3noJSJu',
      p12Certificate: 'apiclient_cert.p12',
      checked: true,
      readingProtocol: false
    }
  },
  props: {
    agreementShow: {
      type: Boolean,
      default: true
    }
  },
  methods: {
    setMerchantNumber () {
      this.$prompt('请输入邮箱', '提示', {
        confirmButtonText: '确定',
        cancelButtonText: '取消',
        inputPattern: /[\w!#$%&'*+/=?^_`{|}~-]+(?:\.[\w!#$%&'*+/=?^_`{|}~-]+)*@(?:[\w](?:[\w-]*[\w])?\.)+[\w](?:[\w-]*[\w])?/,
        inputErrorMessage: '邮箱格式不正确'
      }).then(({ value }) => {
        this.$message({
          type: 'success',
          message: '你的邮箱是: ' + value
        })
      }).catch(() => {
        this.$message({
          type: 'info',
          message: '取消输入'
        })
      })
    }
  }
}
</script>

<style scoped lang="less">
  .pay-information-setting {
    padding: 0 0 10px;
    padding-left: 5px;
    li {
      padding-top: 20px;
      font-size: 12px;
      color: #B5B5B5;
      span {
        display: inline-block;
        vertical-align: middle;
        line-height: 1.4;
      }
      .pay-info-title {
        width: 96px;
        text-align: right;
        padding-right: 3px;
      }
      .pay-info-txt {
        width: 250px;
        color: #333;
        padding-right: 10px;
      }
      .el-button--small {
        margin-right: 25px;
      }
    }
  }
  .checked-protocol {
    padding-left: 74px;
    padding-top: 60px;
    .checked-protocol-text {
      color: #999;
    }
    .el-button--text {
      padding: 0;
      border: none;
    }
    .dialog-footer {
      text-align: center;
      display: block;
    }
  }
  .el-button--small {
    width: 80px;
    height: 30px;
    padding: 0;
    vertical-align: middle;
  }
</style>
